#include <iostream>

// อธิบายการทำงานของโปรแกรม iostream ประกอบไปด้วยฟังก์ชั่นการทำงานเกี่ยวกับ Input และ Output
// include ซึ่งแต่ละชุดคำสั่งจบด้วยการขึ้นบรรทัดใหม่
// ต่อมาเป็นฟังก์ชันในการทำงานหลักของโปรแกรม เมื่อโปรแกรมในภาษา C++ เริ่มต้นการทำงานนั้นจะเริ่มต้นทำงานในฟังก์ชันที่ชื่อว่า main() นั่นหมายความว่าโปรแกรมในภาษา C++ ต้องมีฟังก์ชันนี้เสมอซึ่งถือว่าเป็นฟังก์ชันหลักของโปรแกรม
// Statement (คำสั่งการทำงาน) Statement คือคำสั่งการทำงานของโปรแกรมในภาษา C++ ในการเขียนโปรแกรมหนึ่งโปรแกรมนั้นโดยส่วนมากแล้วจะประกอบไปด้วยหลายคำสั่งเพื่อให้การทำงานเสร็จสิ้น จากตัวอย่างก่อนหน้า std::cout << "Hello World!"; นั้นคือคำสั่งการทำงานของโปรแกรม คำสั่งในภาษา C++ นั้นจะจบด้วยเครื่องหมายเซมิโคลอน (;) ดังนั้นหลายคำสั่งอาจจะอยู่ในบรรทัดเดียวกันได้

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}